experiments/results/batches/6505451-two-policy-smoke/raw/adaptive-disconnect-02-20260829T030720Z/k6.log
time="2026-08-29T03:07:24Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hls.js
        output: json (/results/k6-metrics.jsonl)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 48s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 18s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 1/5 VUs  01.0s/18.0s

running (02.0s), 1/5 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 1/5 VUs  02.0s/18.0s

running (03.0s), 2/5 VUs, 18 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  03.0s/18.0s

running (04.0s), 2/5 VUs, 28 complete and 0 interrupted iterations
default   [  22% ] 2/5 VUs  04.0s/18.0s

running (05.0s), 2/5 VUs, 38 complete and 0 interrupted iterations
default   [  28% ] 2/5 VUs  05.0s/18.0s

running (06.0s), 2/5 VUs, 47 complete and 0 interrupted iterations
default   [  33% ] 2/5 VUs  06.0s/18.0s

running (07.0s), 2/5 VUs, 57 complete and 0 interrupted iterations
default   [  39% ] 2/5 VUs  07.0s/18.0s

running (08.0s), 2/5 VUs, 67 complete and 0 interrupted iterations
default   [  44% ] 2/5 VUs  08.0s/18.0s

running (09.0s), 3/5 VUs, 78 complete and 0 interrupted iterations
default   [  50% ] 3/5 VUs  09.0s/18.0s

running (10.0s), 4/5 VUs, 96 complete and 0 interrupted iterations
default   [  56% ] 4/5 VUs  10.0s/18.0s

running (11.0s), 5/5 VUs, 119 complete and 0 interrupted iterations
default   [  61% ] 5/5 VUs  11.0s/18.0s

running (12.0s), 5/5 VUs, 141 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  12.0s/18.0s

running (13.0s), 5/5 VUs, 164 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  13.0s/18.0s

running (14.0s), 5/5 VUs, 187 complete and 0 interrupted iterations
default   [  78% ] 5/5 VUs  14.0s/18.0s

running (15.0s), 5/5 VUs, 212 complete and 0 interrupted iterations
default   [  83% ] 5/5 VUs  15.0s/18.0s

running (16.0s), 5/5 VUs, 234 complete and 0 interrupted iterations
default   [  89% ] 5/5 VUs  16.0s/18.0s

running (17.0s), 4/5 VUs, 257 complete and 0 interrupted iterations
default   [  94% ] 4/5 VUs  17.0s/18.0s

running (18.0s), 3/5 VUs, 271 complete and 0 interrupted iterations
default   [ 100% ] 3/5 VUs  18.0s/18.0s


  █ THRESHOLDS 

    hls_playlist_failures
    ✓ 'count>=0' count=0

    hls_segment_failures
    ✓ 'count>=0' count=0

    hls_session_failures
    ✓ 'rate>=0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 822     45.42764/s
    checks_succeeded...: 100.00% 822 out of 822
    checks_failed......: 0.00%   0 out of 822

    ✓ master playlist is 200
    ✓ media playlist is 200
    ✓ segment is 200

    CUSTOM
    hls_playlist_failures..........: 0      0/s
    hls_playlist_requests..........: 548    30.285094/s
    hls_segment_duration...........: avg=8.99ms   min=653.7µs  med=1.19ms   max=503.85ms p(90)=3.75ms  p(95)=4.62ms  p(99)=501.82ms
    hls_segment_failures...........: 0      0/s
    hls_segment_requests...........: 274    15.142547/s
    hls_session_failures...........: 0.00%  0 out of 274
    selected_edge_node.............: 822    45.42764/s

    HTTP
    http_req_duration..............: avg=3.39ms   min=144.68µs med=489.41µs max=503.85ms p(90)=2.58ms  p(95)=3.67ms  p(99)=7.25ms  
      { expected_response:true }...: avg=3.39ms   min=144.68µs med=489.41µs max=503.85ms p(90)=2.58ms  p(95)=3.67ms  p(99)=7.25ms  
    http_req_failed................: 0.00%  0 out of 836
    http_reqs......................: 836    46.201347/s

    EXECUTION
    iteration_duration.............: avg=213.01ms min=202.09ms med=203.91ms max=738.27ms p(90)=209.2ms p(95)=215.6ms p(99)=712.48ms
    iterations.....................: 274    15.142547/s
    vus............................: 3      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 316 MB 18 MB/s
    data_sent......................: 171 kB 9.5 kB/s



running (18.1s), 0/5 VUs, 274 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  18s